start_msg = """Привет! Это бот лояльности от Beauty Bomb 🤖

Мы создали приложение ВВCore, где ты можешь зарабатывать ВВ-баллы и обменивать их на разные призы: туториалы, скидки, промокоды и многое другое 😳

В приложении тебе ждёт информация о Beauty Bomb и наших конкурсах, а также доступ к твоим ВВ-баллам, где ты и сможешь обменять их на призы 💝

Как можно заработать ВВ-баллы:
🔸 написать комментарии под постами в нашем Телеграм-канале;
🔸 прислать чек о покупке наших продуктов;
🔸 участвовать в хэштег-челлендже #BBCore и получать ВВ-баллы за просмотры;
🔸 рекомендовать бота друзьям; рассказать о Beauty Bomb в постах на своём Телеграм-канале!

Запускай приложение через кнопку «Start» внизу экрана и погружайся во вселенную #BBCore ✌
"""

menu_msg = """В приложении BBCore тебя всегда ждёт интересная инфа от Beauty Bomb, возможность участвовать в конкурсах и зарабатывать ВВ-баллы, которые можно обменять на прикольные призы, например: промокоды, туториалы, скидки и многое другое  Ничего не жди, скорее запускай!"""

mention_msg = """Ты можешь получить 20 ВВ-баллов за упоминание Beauty Bomb в посте на своём Телеграм-канале 💭

Но важно, чтобы пост подходил по всем критериям:
❣️ пост должен быть минимум 30-м на твоём канале;
❣️ в посте есть упоминание Beauty Bomb;
❣️ упоминание в этом посте не было засчитано другому участнику!

P.S.: всего за неделю можно получить ВВ-баллы за три поста!

Пересылай подходящий пост ответным сообщением 🔗"""


error_post_msg = """1. Не могу начислить ВВ-баллы за этот пост, так как ты прислала уже три поста на этой неделе 🥺

Пришли этот пост на следующей неделе, чтобы получить 20 ВВ-баллов!

2. Не могу начислить ВВ-баллы за этот пост, так как пост с упоминанием должен быть минимум 30-м на твоём канале 🥺💙
3. Не могу начислить ВВ-баллы за этот пост, ведь в нём нет упоминания Beauty Bomb 🥹
4. Не могу начислить ВВ-баллы за этот пост, так как они уже начислены за него другому пользователю 🥺

Проверь свой пост по всем пунктам и возвращайся с ним снова, когда все правила будут выполнены ✨"""


new_sn_msg = """Хэштег-челлендж #BBCore — это возможность заработать ВВ-баллы за просмотры в соцсетях ✌️

Для участия:
📎 выложи в TikTok, Likee, Shorts или VK Клипы видео, снятое около стенда Beauty Bomb;
📎 это может быть мем, туториал, тренд или творческое видео;
📎 добавь в описание хэштег #BBCore.

Количество ВВ-баллов зависит от количества просмотров:
🌀 10 000 просмотров — 100 ВВ-баллов;
🌀 50 000 просмотров — 200 ВВ-баллов;
🌀 100 000 просмотров — 400 ВВ-баллов;
🌀 500 000 просмотров — 800 ВВ-баллов;
🌀 1 000 000 просмотров — 1500 ВВ-баллов.

Ты готова к участию? Тогда выбери соцсеть, аккаунт в которой ты хочешь привязать ⬇️
"""

sn_msg = """Внизу ты видишь список соцсетей 👁️ ️

Здесь ты можешь:

👉 выбрать соцсеть, к которой у тебя уже привязан аккаунт, чтобы прислать мне видео с достаточным количеством просмотров для получения ВВ-баллов;
👉 выбрать соцсеть, к которой хочешь привязать аккаунт;
👉 вернуться в меню."""


cancel_msg = """Твоё видео не соответствует заданным условиям 🥺

Напомню тебе правила участия в хэштег-челлендже:
◽️ видео, снятое около стенда Beauty Bomb, должно быть опубликовано в соцсетях TikTok, Likee, Shorts или VK Клипы;
◽️ это может быть мем, туториал, тренд или творческое видео;
◽️ в описании видео должен быть хэштег #BBCore.

Буду ждать другие твои видосики! 💙"""


comment_msg = """10 ВВ-баллов за твой комментарий на канале «Подслушано Бьюти Бомб» уже начислены 😎

Ты можешь зарабатывать 10 ВВ-баллов каждый час за один комментарий, так что ставь напоминалки 💭"""


check_start_msg = """Ты можешь получить ВВ-баллы за покупку товаров Beauty Bomb 😎

Количество ВВ-баллов зависит от суммы покупки товаров Beauty Bomb:  
🔻 300 рублей — до 50 ВВ-баллов;
🔻 500 рублей — до 150 ВВ-баллов;
🔻 800 рублей — до 250 ВВ-баллов;
🔻 1500 рублей — до 400 ВВ-баллов;
🔻 3000 рублей — до 800 ВВ-баллов;
🔻 5000 рублей — до 1500 ВВ-баллов.

Отправь ответным сообщением чёткую фотографию чека, чтобы QR-код был хорошо виден, и я смог проверить его как можно скорее 🧾📸"""
